import sys
input = sys.stdin.readline
MAX = 1e9

n = int(input())
ingres = [tuple(map(int, input().split())) for _ in range(n)]
answer = MAX

for set in range(1, 1 << n): # 조합 개수(16) 1~15
  print('🍎set:',set)
  s = 1
  b = 0
  for j in range(n):
    print('-', 'j:',j, '/',(1 << j), '/', set & (1 << j))
    # set와 재료 index(j)들을 비교해서 1(True)인지 아닌지(False) 구분한다.
    # 한 세트당 0이 아닌 인덱스 j들이 조합을 이룸
    if (set & (1 << j)) != 0: 
      s *= ingres[j][0]
      b += ingres[j][1]
  answer = min(answer, abs(s - b))
print(answer)

# 약간 빈칸 채우기 하듯이 조합을 만들어냄
# 🍎set: 1 (0001)
# - j: 0 / 1(0001) / 1
# - j: 1 / 2(0010) / 0
# - j: 2 / 4(0100) / 0
# - j: 3 / 8(1000) / 0
# 🍎set: 2 (0010)
# - j: 0 / 1 / 0
# - j: 1 / 2 / 2
# - j: 2 / 4 / 0
# - j: 3 / 8 / 0
# 🍎set: 3
# - j: 0 / 1 / 1
# - j: 1 / 2 / 2
# - j: 2 / 4 / 0
# - j: 3 / 8 / 0
# 🍎set: 4
# - j: 0 / 1 / 0
# - j: 1 / 2 / 0
# - j: 2 / 4 / 4
# - j: 3 / 8 / 0
# 🍎set: 5
# - j: 0 / 1 / 1
# - j: 1 / 2 / 0
# - j: 2 / 4 / 4
# - j: 3 / 8 / 0
# 🍎set: 6
# - j: 0 / 1 / 0
# - j: 1 / 2 / 2
# - j: 2 / 4 / 4
# - j: 3 / 8 / 0
# 🍎set: 7
# - j: 0 / 1 / 1
# - j: 1 / 2 / 2
# - j: 2 / 4 / 4
# - j: 3 / 8 / 0
# 🍎set: 8
# - j: 0 / 1 / 0
# - j: 1 / 2 / 0
# - j: 2 / 4 / 0
# - j: 3 / 8 / 8
# 🍎set: 9
# - j: 0 / 1 / 1
# - j: 1 / 2 / 0
# - j: 2 / 4 / 0
# - j: 3 / 8 / 8
# 🍎set: 10
# - j: 0 / 1 / 0
# - j: 1 / 2 / 2
# - j: 2 / 4 / 0
# - j: 3 / 8 / 8
# 🍎set: 11
# - j: 0 / 1 / 1
# - j: 1 / 2 / 2
# - j: 2 / 4 / 0
# - j: 3 / 8 / 8
# 🍎set: 12
# - j: 0 / 1 / 0
# - j: 1 / 2 / 0
# - j: 2 / 4 / 4
# - j: 3 / 8 / 8
# 🍎set: 13
# - j: 0 / 1 / 1
# - j: 1 / 2 / 0
# - j: 2 / 4 / 4
# - j: 3 / 8 / 8
# 🍎set: 14
# - j: 0 / 1 / 0
# - j: 1 / 2 / 2
# - j: 2 / 4 / 4
# - j: 3 / 8 / 8
# 🍎set: 15
# - j: 0 / 1 / 1
# - j: 1 / 2 / 2
# - j: 2 / 4 / 4
# - j: 3 / 8 / 8

# 4
# 1 7
# 2 6
# 3 8
# 4 9